//Custom class in project directory
class Questions {
  Questions._();

  static List<List> twoDList = [
    [1,"الي ماذا يشير مصطلح الذهب الاسود ؟", "النفط", "البترول", "الفحم", "الذهب الروسي",1,false,true,false,false],//البترول
    [2,"شيء يتواجد في كل مكان من حولك ولكنك لا تستطيع أن تراه ؟", "الماء", "الهواء", "الدخان", "القمر",2,false,true,false,false],//الهواء
    [3,"نوع من أنواع الحيوانات يقوم بحك أذنه من خلال أنفه فما هو ؟", "النمر", "الذبابة", "الفيل", "الأسد",3,false,false,true,false],//الفيل
    [4,"شيء يمكنك ان تقوم به دون ان تبذل أي مجهود في حياتك ؟", "الركض", "التسلق", "المرح", "الفشل",2,false,false,false,true],//الفشل
    [5,"أضعف بيت على وجه الأرض ؟", "بيت العنكبوت", "الكهف", "بيت الدب القطبي", "بيت النحل",10,true,false,false,false],//بيت العنكبوت
    [6,"بيت لا يتواجد به أبواب أو شبابيك مطلقًا ؟", "النفط", "البترول", "الفحم", "الذهب الروسي",3,false,false,false,true],//البترول
    [7,"الي ماذا يشير مصطلح الذهب الاسود ؟", "بيت الشعر", "بيت النمل", "بيت النحل", "البيت الخشبي",2,false,false,false,true],//بيت الشعر
    [8,"الوقت الذي يكون فيه النهر بدون ماء ؟", "في الليل", "رؤيته من بعيد", "على الخريطة", "عند عدم اتصاله بمحيط",3,false,false,false,true],//على الخريطة
    [9,"أين تتواجد حاسة الشم عند الثعبان ؟", "في لسانه", "في اعلى رأسه", "لا يملك هذه الحاسة أبداً", "اعلى أسنانه",1,false,false,false,true],//في لسانه
    [10,"شيء مهم في حياتنا يفقد ذيله إذا مشى خطوات إلى الأمام ؟", "الحيط", "الخيط", "الخليط", "المحيط",1,false,false,false,true],//الخيط
    [11,"أطول نهر من أنها قارة آسيا ؟", "نهر اليانغتسي", "نهر اليرموك", "نهر النيل", "نهر الفرات",2,false,false,false,true],//نهر اليانغتسي
    [12,"أي دولة من الدول يلتقي فيها نهر النيل مع البحر ؟", "في مصر", "الهند", "الأردن", "تركيا",1,true,false,false,false],//في مصر
    [13,"دولة من الدول تكون الحدود بها مفتوحة على دولة أخرى ؟", "العراق والسعودية", "سوريا وتركيا", "اوكرانيا مع روسيا", "دولة نيوزيلاندا ودولة استراليا",3,false,false,false,true],//دولة نيوزيلاندا ودولة استراليا
    [14,"أكبر بركان من براكين العالم ؟", "جبل لاو", "البركان القطبي", "بركان الهند العظيم", "بركان السرق الأوسط",3,false,false,false,true],//جبل لاو
    [15,"ما هي الدولة التي يتواجد بها عاصمة تسمى بوخارست ؟", "دولة رومانيا", "الموزمبيق", "تونس", "الولايات المتحدةالأمريكية",2,false,false,false,true],//دولة رومانيا
    [16,"أطول نهر من أنهار العالم ؟", "نهر الفرات", "نهر النيل", "نهر شترستوك", "نهر الأمازون",2,false,false,false,true],//نهر النيل
    [17,"ما هي أكبر ثاني دولة من دول العالم ؟", "روسيا", "البحرين", "كندا", "تركيا",1,false,false,false,true],//كندا
    [18,"محيط يقع بين أمريكا وبين أوروبا ؟", "المحيط الأطلسي", "المحيط الهاديء", "الفحم", "الذهب الروسي",2,false,false,false,true],
    [19,"أداة الباكسل في ماذا تستخدم ؟", "تستخدم الباكسل في قياس الأوزان الثقيلة", "تستخدم الباكسل في قياس الكيلو واط", "تستخدم الباكسل في قياس الطول", "تستخدم الباكسل في قياس الضغط",3,false,false,false,true],//تستخدم الباكسل في قياس الضغط
    [20,"ما هو الكوب السادس في النظام الشمسي ؟", "كوكب نيبتون", "كوكب الأرض", "كوكب المشتري", "كوكب زحل",2,false,false,false,true],//كوكب زحل
    [21,"الي ماذا يشير مصطلح الذهب الاسود ؟", "النفط", "البترول", "الفحم", "الذهب الروسي",3,false,false,false,true],
    [22,"شيء يتواجد في كل مكان من حولك ولكنك لا تستطيع أن تراه ؟", "الماء", "الهواء", "الدخان", "القمر",2,false,false,false,true],//الهواء
    [33,"نوع من أنواع الحيوانات يقوم بحك أذنه من خلال أنفه فما هو ؟", "النمر", "الذبابة", "الفيل", "الأسد",3,false,false,false,true],//الفيل
    [24,"شيء يمكنك ان تقوم به دون ان تبذل أي مجهود في حياتك ؟", "الركض", "التسلق", "المرح", "الفشل",2,false,false,false,true],//الفشل
    [25,"أضعف بيت على وجه الأرض ؟", "بيت العنكبوت", "الكهف", "بيت الدب القطبي", "بيت النحل",2,false,false,false,true],//بيت العنكبوت
    [26,"بيت لا يتواجد به أبواب أو شبابيك مطلقًا ؟", "النفط", "البترول", "الفحم", "الذهب الروسي",3,false,false,false,true],
    [27,"الي ماذا يشير مصطلح الذهب الاسود ؟", "بيت الشعر", "بيت النمل", "بيت النحل", "البيت الخشبي",2,false,false,false,true],//بيت الشعر
    [28,"الوقت الذي يكون فيه النهر بدون ماء ؟", "في الليل", "رؤيته من بعيد", "على الخريطة", "عند عدم اتصاله بمحيط",3,false,false,false,true],//على الخريطة
    [29,"أين تتواجد حاسة الشم عند الثعبان ؟", "في لسانه", "في اعلى رأسه", "لا يملك هذه الحاسة أبداً", "اعلى أسنانه",1,false,false,false,true],//في لسانه
    [30,"شيء مهم في حياتنا يفقد ذيله إذا مشى خطوات إلى الأمام ؟", "الحيط", "الخيط", "الخليط", "المحيط",1,false,false,false,true],//الخيط
    [31,"أطول نهر من أنها قارة آسيا ؟", "نهر اليانغتسي", "نهر اليرموك", "نهر النيل", "نهر الفرات",2,false,false,false,true],//نهر اليانغتسي
    [32,"أي دولة من الدول يلتقي فيها نهر النيل مع البحر ؟", "في مصر", "الهند", "الأردن", "تركيا",1,false,false,false,true],//في مصر
    [33,"دولة من الدول تكون الحدود بها مفتوحة على دولة أخرى ؟", "العراق والسعودية", "سوريا وتركيا", "اوكرانيا مع روسيا", "دولة نيوزيلاندا ودولة استراليا",3,false,false,false,true],//دولة نيوزيلاندا ودولة استراليا
    [34,"أكبر بركان من براكين العالم ؟", "جبل لاو", "البركان القطبي", "بركان الهند العظيم", "بركان السرق الأوسط",3,false,false,false,true],//جبل لاو
    [35,"ما هي الدولة التي يتواجد بها عاصمة تسمى بوخارست ؟", "دولة رومانيا", "الموزمبيق", "تونس", "الولايات المتحدةالأمريكية",2,false,false,false,true],//دولة رومانيا
    // [36,"أطول نهر من أنهار العالم ؟", "نهر الفرات", "نهر النيل", "نهر شترستوك", "نهر الأمازون",2],//نهر النيل
    // [37,"ما هي أكبر ثاني دولة من دول العالم ؟", "روسيا", "البحرين", "كندا", "تركيا",1],//كندا
    // [38,"محيط يقع بين أمريكا وبين أوروبا ؟", "المحيط الأطلسي", "المحيط الهاديء", "الفحم", "الذهب الروسي",2],
    // [39,"أداة الباكسل في ماذا تستخدم ؟", "تستخدم الباكسل في قياس الأوزان الثقيلة", "تستخدم الباكسل في قياس الكيلو واط", "تستخدم الباكسل في قياس الطول", "تستخدم الباكسل في قياس الضغط",3],//تستخدم الباكسل في قياس الضغط
    // [40,"ما هو الكوب السادس في النظام الشمسي ؟", "كوكب نيبتون", "كوكب الأرض", "كوكب المشتري", "كوكب زحل",2],//كوكب زحل
    // [41,"الي ماذا يشير مصطلح الذهب الاسود ؟", "النفط", "البترول", "الفحم", "الذهب الروسي",3],
    // [42,"شيء يتواجد في كل مكان من حولك ولكنك لا تستطيع أن تراه ؟", "الماء", "الهواء", "الدخان", "القمر",2],//الهواء
    // [43,"نوع من أنواع الحيوانات يقوم بحك أذنه من خلال أنفه فما هو ؟", "النمر", "الذبابة", "الفيل", "الأسد",3],//الفيل
    // [44,"شيء يمكنك ان تقوم به دون ان تبذل أي مجهود في حياتك ؟", "الركض", "التسلق", "المرح", "الفشل",2],//الفشل
    // [45,"أضعف بيت على وجه الأرض ؟", "بيت العنكبوت", "الكهف", "بيت الدب القطبي", "بيت النحل",2],//بيت العنكبوت
    // [46,"بيت لا يتواجد به أبواب أو شبابيك مطلقًا ؟", "النفط", "البترول", "الفحم", "الذهب الروسي",3],
    // [47,"الي ماذا يشير مصطلح الذهب الاسود ؟", "بيت الشعر", "بيت النمل", "بيت النحل", "البيت الخشبي",2],//بيت الشعر
    // [48,"الوقت الذي يكون فيه النهر بدون ماء ؟", "في الليل", "رؤيته من بعيد", "على الخريطة", "عند عدم اتصاله بمحيط",3],//على الخريطة
    // [49,"أين تتواجد حاسة الشم عند الثعبان ؟", "في لسانه", "في اعلى رأسه", "لا يملك هذه الحاسة أبداً", "اعلى أسنانه",1],//في لسانه
    // [50,"شيء مهم في حياتنا يفقد ذيله إذا مشى خطوات إلى الأمام ؟", "الحيط", "الخيط", "الخليط", "المحيط",1],//الخيط
    // [51,"أطول نهر من أنها قارة آسيا ؟", "نهر اليانغتسي", "نهر اليرموك", "نهر النيل", "نهر الفرات",2],//نهر اليانغتسي
    // [52,"أي دولة من الدول يلتقي فيها نهر النيل مع البحر ؟", "في مصر", "الهند", "الأردن", "تركيا",1],//في مصر
    // [53,"دولة من الدول تكون الحدود بها مفتوحة على دولة أخرى ؟", "العراق والسعودية", "سوريا وتركيا", "اوكرانيا مع روسيا", "دولة نيوزيلاندا ودولة استراليا",3],//دولة نيوزيلاندا ودولة استراليا
    // [54,"أكبر بركان من براكين العالم ؟", "جبل لاو", "البركان القطبي", "بركان الهند العظيم", "بركان السرق الأوسط",3],//جبل لاو
    // [55,"ما هي الدولة التي يتواجد بها عاصمة تسمى بوخارست ؟", "دولة رومانيا", "الموزمبيق", "تونس", "الولايات المتحدةالأمريكية",2],//دولة رومانيا
    // [56,"أطول نهر من أنهار العالم ؟", "نهر الفرات", "نهر النيل", "نهر شترستوك", "نهر الأمازون",2],//نهر النيل
    // [57,"ما هي أكبر ثاني دولة من دول العالم ؟", "روسيا", "البحرين", "كندا", "تركيا",1],//كندا
    // [58,"محيط يقع بين أمريكا وبين أوروبا ؟", "المحيط الأطلسي", "المحيط الهاديء", "الفحم", "الذهب الروسي",2],
    // [59,"أداة الباكسل في ماذا تستخدم ؟", "تستخدم الباكسل في قياس الأوزان الثقيلة", "تستخدم الباكسل في قياس الكيلو واط", "تستخدم الباكسل في قياس الطول", "تستخدم الباكسل في قياس الضغط",3],//تستخدم الباكسل في قياس الضغط
    // [60,"ما هو الكوب السادس في النظام الشمسي ؟", "كوكب نيبتون", "كوكب الأرض", "كوكب المشتري", "كوكب زحل",2],//كوكب زحل
    // [41,"الي ماذا يشير مصطلح الذهب الاسود ؟", "النفط", "البترول", "الفحم", "الذهب الروسي",3],
    // [42,"شيء يتواجد في كل مكان من حولك ولكنك لا تستطيع أن تراه ؟", "الماء", "الهواء", "الدخان", "القمر",2],//الهواء
    // [43,"نوع من أنواع الحيوانات يقوم بحك أذنه من خلال أنفه فما هو ؟", "النمر", "الذبابة", "الفيل", "الأسد",3],//الفيل
    // [44,"شيء يمكنك ان تقوم به دون ان تبذل أي مجهود في حياتك ؟", "الركض", "التسلق", "المرح", "الفشل",2],//الفشل
    // [45,"أضعف بيت على وجه الأرض ؟", "بيت العنكبوت", "الكهف", "بيت الدب القطبي", "بيت النحل",2],//بيت العنكبوت
    // [46,"بيت لا يتواجد به أبواب أو شبابيك مطلقًا ؟", "النفط", "البترول", "الفحم", "الذهب الروسي",3],
    // [47,"الي ماذا يشير مصطلح الذهب الاسود ؟", "بيت الشعر", "بيت النمل", "بيت النحل", "البيت الخشبي",2],//بيت الشعر
    // [48,"الوقت الذي يكون فيه النهر بدون ماء ؟", "في الليل", "رؤيته من بعيد", "على الخريطة", "عند عدم اتصاله بمحيط",3],//على الخريطة
    // [49,"أين تتواجد حاسة الشم عند الثعبان ؟", "في لسانه", "في اعلى رأسه", "لا يملك هذه الحاسة أبداً", "اعلى أسنانه",1],//في لسانه
    // [50,"شيء مهم في حياتنا يفقد ذيله إذا مشى خطوات إلى الأمام ؟", "الحيط", "الخيط", "الخليط", "المحيط",1],//الخيط
    // [51,"أطول نهر من أنها قارة آسيا ؟", "نهر اليانغتسي", "نهر اليرموك", "نهر النيل", "نهر الفرات",2],//نهر اليانغتسي
    // [52,"أي دولة من الدول يلتقي فيها نهر النيل مع البحر ؟", "في مصر", "الهند", "الأردن", "تركيا",1],//في مصر
    // [53,"دولة من الدول تكون الحدود بها مفتوحة على دولة أخرى ؟", "العراق والسعودية", "سوريا وتركيا", "اوكرانيا مع روسيا", "دولة نيوزيلاندا ودولة استراليا",3],//دولة نيوزيلاندا ودولة استراليا
    // [54,"أكبر بركان من براكين العالم ؟", "جبل لاو", "البركان القطبي", "بركان الهند العظيم", "بركان السرق الأوسط",3],//جبل لاو
    // [55,"ما هي الدولة التي يتواجد بها عاصمة تسمى بوخارست ؟", "دولة رومانيا", "الموزمبيق", "تونس", "الولايات المتحدةالأمريكية",2],//دولة رومانيا
    // [56,"أطول نهر من أنهار العالم ؟", "نهر الفرات", "نهر النيل", "نهر شترستوك", "نهر الأمازون",2],//نهر النيل
    // [57,"ما هي أكبر ثاني دولة من دول العالم ؟", "روسيا", "البحرين", "كندا", "تركيا",1],//كندا
    // [58,"محيط يقع بين أمريكا وبين أوروبا ؟", "المحيط الأطلسي", "المحيط الهاديء", "الفحم", "الذهب الروسي",2],
    // [59,"أداة الباكسل في ماذا تستخدم ؟", "تستخدم الباكسل في قياس الأوزان الثقيلة", "تستخدم الباكسل في قياس الكيلو واط", "تستخدم الباكسل في قياس الطول", "تستخدم الباكسل في قياس الضغط",3],//تستخدم الباكسل في قياس الضغط
    // [60,"ما هو الكوب السادس في النظام الشمسي ؟", "كوكب نيبتون", "كوكب الأرض", "كوكب المشتري", "كوكب زحل",2],//كوكب زحل
    // [61,"الي ماذا يشير مصطلح الذهب الاسود ؟", "النفط", "البترول", "الفحم", "الذهب الروسي",3],
    // [62,"شيء يتواجد في كل مكان من حولك ولكنك لا تستطيع أن تراه ؟", "الماء", "الهواء", "الدخان", "القمر",2],//الهواء
    // [63,"نوع من أنواع الحيوانات يقوم بحك أذنه من خلال أنفه فما هو ؟", "النمر", "الذبابة", "الفيل", "الأسد",3],//الفيل
    // [64,"شيء يمكنك ان تقوم به دون ان تبذل أي مجهود في حياتك ؟", "الركض", "التسلق", "المرح", "الفشل",2],//الفشل
    // [65,"أضعف بيت على وجه الأرض ؟", "بيت العنكبوت", "الكهف", "بيت الدب القطبي", "بيت النحل",2],//بيت العنكبوت
    // [66,"بيت لا يتواجد به أبواب أو شبابيك مطلقًا ؟", "النفط", "البترول", "الفحم", "الذهب الروسي",3],
    // [67,"الي ماذا يشير مصطلح الذهب الاسود ؟", "بيت الشعر", "بيت النمل", "بيت النحل", "البيت الخشبي",2],//بيت الشعر
    // [68,"الوقت الذي يكون فيه النهر بدون ماء ؟", "في الليل", "رؤيته من بعيد", "على الخريطة", "عند عدم اتصاله بمحيط",3],//على الخريطة
    // [69,"أين تتواجد حاسة الشم عند الثعبان ؟", "في لسانه", "في اعلى رأسه", "لا يملك هذه الحاسة أبداً", "اعلى أسنانه",1],//في لسانه
    // [70,"شيء مهم في حياتنا يفقد ذيله إذا مشى خطوات إلى الأمام ؟", "الحيط", "الخيط", "الخليط", "المحيط",1],//الخيط
    // [71,"أطول نهر من أنها قارة آسيا ؟", "نهر اليانغتسي", "نهر اليرموك", "نهر النيل", "نهر الفرات",2],//نهر اليانغتسي
    // [72,"أي دولة من الدول يلتقي فيها نهر النيل مع البحر ؟", "في مصر", "الهند", "الأردن", "تركيا",1],//في مصر
    // [73,"دولة من الدول تكون الحدود بها مفتوحة على دولة أخرى ؟", "العراق والسعودية", "سوريا وتركيا", "اوكرانيا مع روسيا", "دولة نيوزيلاندا ودولة استراليا",3],//دولة نيوزيلاندا ودولة استراليا
    // [74,"أكبر بركان من براكين العالم ؟", "جبل لاو", "البركان القطبي", "بركان الهند العظيم", "بركان السرق الأوسط",3],//جبل لاو
    // [75,"ما هي الدولة التي يتواجد بها عاصمة تسمى بوخارست ؟", "دولة رومانيا", "الموزمبيق", "تونس", "الولايات المتحدةالأمريكية",2],//دولة رومانيا
    // [76,"أطول نهر من أنهار العالم ؟", "نهر الفرات", "نهر النيل", "نهر شترستوك", "نهر الأمازون",2],//نهر النيل
    // [77,"ما هي أكبر ثاني دولة من دول العالم ؟", "روسيا", "البحرين", "كندا", "تركيا",1],//كندا
    // [78,"محيط يقع بين أمريكا وبين أوروبا ؟", "المحيط الأطلسي", "المحيط الهاديء", "الفحم", "الذهب الروسي",2],
    // [79,"أداة الباكسل في ماذا تستخدم ؟", "تستخدم الباكسل في قياس الأوزان الثقيلة", "تستخدم الباكسل في قياس الكيلو واط", "تستخدم الباكسل في قياس الطول", "تستخدم الباكسل في قياس الضغط",3],//تستخدم الباكسل في قياس الضغط
    // [80,"ما هو الكوب السادس في النظام الشمسي ؟", "كوكب نيبتون", "كوكب الأرض", "كوكب المشتري", "كوكب زحل",2],//كوكب زحل
    // [61,"الي ماذا يشير مصطلح الذهب الاسود ؟", "النفط", "البترول", "الفحم", "الذهب الروسي",3],
    // [62,"شيء يتواجد في كل مكان من حولك ولكنك لا تستطيع أن تراه ؟", "الماء", "الهواء", "الدخان", "القمر",2],//الهواء
    // [63,"نوع من أنواع الحيوانات يقوم بحك أذنه من خلال أنفه فما هو ؟", "النمر", "الذبابة", "الفيل", "الأسد",3],//الفيل
    // [64,"شيء يمكنك ان تقوم به دون ان تبذل أي مجهود في حياتك ؟", "الركض", "التسلق", "المرح", "الفشل",2],//الفشل
    // [65,"أضعف بيت على وجه الأرض ؟", "بيت العنكبوت", "الكهف", "بيت الدب القطبي", "بيت النحل",2],//بيت العنكبوت
    // [66,"بيت لا يتواجد به أبواب أو شبابيك مطلقًا ؟", "النفط", "البترول", "الفحم", "الذهب الروسي",3],
    // [67,"الي ماذا يشير مصطلح الذهب الاسود ؟", "بيت الشعر", "بيت النمل", "بيت النحل", "البيت الخشبي",2],//بيت الشعر
    // [68,"الوقت الذي يكون فيه النهر بدون ماء ؟", "في الليل", "رؤيته من بعيد", "على الخريطة", "عند عدم اتصاله بمحيط",3],//على الخريطة
    // [69,"أين تتواجد حاسة الشم عند الثعبان ؟", "في لسانه", "في اعلى رأسه", "لا يملك هذه الحاسة أبداً", "اعلى أسنانه",1],//في لسانه
    // [70,"شيء مهم في حياتنا يفقد ذيله إذا مشى خطوات إلى الأمام ؟", "الحيط", "الخيط", "الخليط", "المحيط",1],//الخيط
    // [71,"أطول نهر من أنها قارة آسيا ؟", "نهر اليانغتسي", "نهر اليرموك", "نهر النيل", "نهر الفرات",2],//نهر اليانغتسي
    // [72,"أي دولة من الدول يلتقي فيها نهر النيل مع البحر ؟", "في مصر", "الهند", "الأردن", "تركيا",1],//في مصر
    // [73,"دولة من الدول تكون الحدود بها مفتوحة على دولة أخرى ؟", "العراق والسعودية", "سوريا وتركيا", "اوكرانيا مع روسيا", "دولة نيوزيلاندا ودولة استراليا",3],//دولة نيوزيلاندا ودولة استراليا
    // [74,"أكبر بركان من براكين العالم ؟", "جبل لاو", "البركان القطبي", "بركان الهند العظيم", "بركان السرق الأوسط",3],//جبل لاو
    // [75,"ما هي الدولة التي يتواجد بها عاصمة تسمى بوخارست ؟", "دولة رومانيا", "الموزمبيق", "تونس", "الولايات المتحدةالأمريكية",2],//دولة رومانيا
    // [76,"أطول نهر من أنهار العالم ؟", "نهر الفرات", "نهر النيل", "نهر شترستوك", "نهر الأمازون",2],//نهر النيل
    // [77,"ما هي أكبر ثاني دولة من دول العالم ؟", "روسيا", "البحرين", "كندا", "تركيا",1],//كندا
    // [78,"محيط يقع بين أمريكا وبين أوروبا ؟", "المحيط الأطلسي", "المحيط الهاديء", "الفحم", "الذهب الروسي",2],
    // [79,"أداة الباكسل في ماذا تستخدم ؟", "تستخدم الباكسل في قياس الأوزان الثقيلة", "تستخدم الباكسل في قياس الكيلو واط", "تستخدم الباكسل في قياس الطول", "تستخدم الباكسل في قياس الضغط",3],//تستخدم الباكسل في قياس الضغط
    // [80,"ما هو الكوب السادس في النظام الشمسي ؟", "كوكب نيبتون", "كوكب الأرض", "كوكب المشتري", "كوكب زحل",2],//كوكب زحل
    // [81,"الي ماذا يشير مصطلح الذهب الاسود ؟", "النفط", "البترول", "الفحم", "الذهب الروسي",3],
    // [82,"شيء يتواجد في كل مكان من حولك ولكنك لا تستطيع أن تراه ؟", "الماء", "الهواء", "الدخان", "القمر",2],//الهواء
    // [83,"نوع من أنواع الحيوانات يقوم بحك أذنه من خلال أنفه فما هو ؟", "النمر", "الذبابة", "الفيل", "الأسد",3],//الفيل
    // [84,"شيء يمكنك ان تقوم به دون ان تبذل أي مجهود في حياتك ؟", "الركض", "التسلق", "المرح", "الفشل",2],//الفشل
    // [85,"أضعف بيت على وجه الأرض ؟", "بيت العنكبوت", "الكهف", "بيت الدب القطبي", "بيت النحل",2],//بيت العنكبوت
    // [86,"بيت لا يتواجد به أبواب أو شبابيك مطلقًا ؟", "النفط", "البترول", "الفحم", "الذهب الروسي",3],
    // [87,"الي ماذا يشير مصطلح الذهب الاسود ؟", "بيت الشعر", "بيت النمل", "بيت النحل", "البيت الخشبي",2],//بيت الشعر
    // [88,"الوقت الذي يكون فيه النهر بدون ماء ؟", "في الليل", "رؤيته من بعيد", "على الخريطة", "عند عدم اتصاله بمحيط",3],//على الخريطة
    // [89,"أين تتواجد حاسة الشم عند الثعبان ؟", "في لسانه", "في اعلى رأسه", "لا يملك هذه الحاسة أبداً", "اعلى أسنانه",1],//في لسانه
    // [90,"شيء مهم في حياتنا يفقد ذيله إذا مشى خطوات إلى الأمام ؟", "الحيط", "الخيط", "الخليط", "المحيط",1],//الخيط
    // [91,"أطول نهر من أنها قارة آسيا ؟", "نهر اليانغتسي", "نهر اليرموك", "نهر النيل", "نهر الفرات",2],//نهر اليانغتسي
    // [92,"أي دولة من الدول يلتقي فيها نهر النيل مع البحر ؟", "في مصر", "الهند", "الأردن", "تركيا",1],//في مصر
    // [93,"دولة من الدول تكون الحدود بها مفتوحة على دولة أخرى ؟", "العراق والسعودية", "سوريا وتركيا", "اوكرانيا مع روسيا", "دولة نيوزيلاندا ودولة استراليا",3],//دولة نيوزيلاندا ودولة استراليا
    // [94,"أكبر بركان من براكين العالم ؟", "جبل لاو", "البركان القطبي", "بركان الهند العظيم", "بركان السرق الأوسط",3],//جبل لاو
    // [95,"ما هي الدولة التي يتواجد بها عاصمة تسمى بوخارست ؟", "دولة رومانيا", "الموزمبيق", "تونس", "الولايات المتحدةالأمريكية",2],//دولة رومانيا
    // [96,"أطول نهر من أنهار العالم ؟", "نهر الفرات", "نهر النيل", "نهر شترستوك", "نهر الأمازون",2],//نهر النيل
    // [97,"ما هي أكبر ثاني دولة من دول العالم ؟", "روسيا", "البحرين", "كندا", "تركيا",1],//كندا
    // [98,"محيط يقع بين أمريكا وبين أوروبا ؟", "المحيط الأطلسي", "المحيط الهاديء", "الفحم", "الذهب الروسي",2],
    // [99,"أداة الباكسل في ماذا تستخدم ؟", "تستخدم الباكسل في قياس الأوزان الثقيلة", "تستخدم الباكسل في قياس الكيلو واط", "تستخدم الباكسل في قياس الطول", "تستخدم الباكسل في قياس الضغط",3],//تستخدم الباكسل في قياس الضغط
    // [100,"ما هو الكوب السادس في النظام الشمسي ؟", "كوكب نيبتون", "كوكب الأرض", "كوكب المشتري", "كوكب زحل",2],//كوكب زحل
  ];
}

/// for learning.
//   //Array List 2D Dart.
//   int row = 3;
//   int col = 4;
//
//   // var twoDList = List.generate(row, (i) => List(col), growable: false);
/// For fill;
//
//   List<List<String>> twoDList = [
//     ["level", "deneme", "null", "null"],
//     ["null", "null", "null", "null"],
//     ["null", "null", "null", "null"]
//   ];